### pandas : data preprocessing 
Also check : Pyspark, Dask

Data Scientist

1. Server ---> read data from server 
2. Local --> access file through network, direct access


. Sql Database         
. Oracle Database           
. Mongodb ( json objects )           
. Firebase                
. txt            
. log file          
. pdf            
. word          
. xls, xlsx                                          
. csv ( comma seperated values ==> Ahmed, Mohamed, Ali)      
. json ( javascript object notation )             
. Live data

In [38]:
import pandas as pd

<h6> U need to read file with its keywords
<br> after that there is no any diffrent bettween any type of extention

In [83]:
data = pd.read_csv("nyc_weather.csv") # now data is data frame

In [84]:
data

,EST,Temperature,DewPoint,Humidity,Sea Level PressureIn,VisibilityMiles,WindSpeedMPH,PrecipitationIn,CloudCover,Events,WindDirDegrees
0,1/1/2016,38,23,52,30.03,10,8.0,0,5,NaN,281
1,1/2/2016,36,18,46,30.02,10,7.0,0,3,NaN,275
2,1/3/2016,40,21,47,29.86,10,8.0,0,1,NaN,277
3,1/4/2016,25,9,44,30.05,10,9.0,0,3,NaN,345
4,1/5/2016,20,-3,41,30.57,10,5.0,0,0,NaN,333
5,1/6/2016,33,4,35,30.50,10,4.0,0,0,NaN,259
6,1/7/2016,39,11,33,30.28,10,2.0,0,3,NaN,293
7,1/8/2016,39,29,64,30.20,10,4.0,0,8,NaN,79
8,1/9/2016,44,38,77,30.16,9,8.0,T,8,Rain,76
9,1/10/2016,50,46,71,29.59,4,NaN,1.8,7,Rain,109
10,1/11/2016,33,8,37,29.92,10,NaN,0,1,NaN,289
11,1/12/2016,35,15,53,29.85,10,6.0,T,4,NaN,235
12,1/13/2016,26,4,42,29.94,10,10.0,0,0,NaN,284
13,1/14/2016,30,12,47,29.95,10,5.0,T,7,NaN,266
14,1/15/2016,43,31,62,29.82,9,5.0,T,2,NaN,101
15,1/16/2016,47,37,70,29.52,8,7.0,0.24,7,Rain,340
16,1/17/2016,36,23,66,29.78,8,6.0,0.05,6,Fog-Snow,345
17,1/18/2016,25,6,53,29.83,9,12.0,T,2,Snow,293
18,1/19/2016,22,3,42,30.03,10,11.0,0,1,NaN,293
19,1/20/2016,32,15,49,30.13,10,6.0,0,2,NaN,302
20,1/21/2016,31,11,45,30.15,10,6.0,0,1,NaN,312
21,1/22/2016,26,6,41,30.21,9,NaN,0.01,3,Snow,34
22,1/23/2016,26,21,78,29.77,1,16.0,2.31,8,Fog-Snow,42
23,1/24/2016,28,11,53,29.92,8,6.0,T,3,Snow,327
24,1/25/2016,34,18,54,30.25,10,3.0,0,2,NaN,286
25,1/26/2016,43,29,56,30.03,10,7.0,0,2,NaN,244
26,1/27/2016,41,22,45,30.03,10,7.0,T,3,Rain,311
27,1/28/2016,37,20,51,29.90,10,5.0,0,1,NaN,234
28,1/29/2016,36,21,50,29.58,10,8.0,0,4,NaN,298
29,1/30/2016,34,16,46,30.01,10,7.0,0,0,NaN,257
30,1/31/2016,46,28,52,29.90,10,5.0,0,0,NaN,241

In [85]:
# u can get data info by this key word
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 31 entries, 0 to 30
Data columns (total 11 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   EST                   31 non-null     object
 1   Temperature           31 non-null     int64
 2   DewPoint              31 non-null     int64
 3   Humidity              31 non-null     int64
 4   Sea Level PressureIn  31 non-null     float64
 5   VisibilityMiles       31 non-null     int64
 6   WindSpeedMPH          28 non-null     float64
 7   PrecipitationIn       31 non-null     object
 8   CloudCover            31 non-null     int64
 9   Events                9 non-null      object
 10  WindDirDegrees        31 non-null     int64
dtypes: float64(2), int64(6), object(3)
memory usage: 2.8+ KB

In [86]:
# every column
data.columns

Index(['EST', 'Temperature', 'DewPoint', 'Humidity', 'Sea Level PressureIn',
       'VisibilityMiles', 'WindSpeedMPH', 'PrecipitationIn', 'CloudCover',
       'Events', 'WindDirDegrees'],
      dtype='object')

In [87]:
#u can access header with two ways

print(data["Temperature"])

#or

data.Temperature

# and access every raw with index
print(data["Temperature"][0])

0     38
1     36
2     40
3     25
4     20
5     33
6     39
7     39
8     44
9     50
10    33
11    35
12    26
13    30
14    43
15    47
16    36
17    25
18    22
19    32
20    31
21    26
22    26
23    28
24    34
25    43
26    41
27    37
28    36
29    34
30    46
Name: Temperature, dtype: int64
38

In [88]:
# u can use list function with every column

print(data.Temperature.max())

print(data.Temperature.min())

print(type(data.Temperature[0]))
data.Temperature = data.Temperature.astype("int16")
print(type(data.Temperature[0]))

print(data['EST'][0:5])

50
20
<class 'numpy.int64'>
<class 'numpy.int16'>
0    1/1/2016
1    1/2/2016
2    1/3/2016
3    1/4/2016
4    1/5/2016
Name: EST, dtype: object

In [89]:
# u can make condetinaly print in ()

data[(data["Temperature"] > 40)]

,EST,Temperature,DewPoint,Humidity,Sea Level PressureIn,VisibilityMiles,WindSpeedMPH,PrecipitationIn,CloudCover,Events,WindDirDegrees
8,1/9/2016,44,38,77,30.16,9,8.0,T,8,Rain,76
9,1/10/2016,50,46,71,29.59,4,NaN,1.8,7,Rain,109
14,1/15/2016,43,31,62,29.82,9,5.0,T,2,NaN,101
15,1/16/2016,47,37,70,29.52,8,7.0,0.24,7,Rain,340
25,1/26/2016,43,29,56,30.03,10,7.0,0,2,NaN,244
26,1/27/2016,41,22,45,30.03,10,7.0,T,3,Rain,311
30,1/31/2016,46,28,52,29.90,10,5.0,0,0,NaN,241

In [90]:
# And there is diffrent operations
# or -> |
# and -> &
# not -> ~


data[(data["Temperature"] > 40) & (data["Events"] == "Rain")]

,EST,Temperature,DewPoint,Humidity,Sea Level PressureIn,VisibilityMiles,WindSpeedMPH,PrecipitationIn,CloudCover,Events,WindDirDegrees
8,1/9/2016,44,38,77,30.16,9,8.0,T,8,Rain,76
9,1/10/2016,50,46,71,29.59,4,NaN,1.8,7,Rain,109
15,1/16/2016,47,37,70,29.52,8,7.0,0.24,7,Rain,340
26,1/27/2016,41,22,45,30.03,10,7.0,T,3,Rain,311

In [91]:
print(data[["EST"]])

          EST
0    1/1/2016
1    1/2/2016
2    1/3/2016
3    1/4/2016
4    1/5/2016
5    1/6/2016
6    1/7/2016
7    1/8/2016
8    1/9/2016
9   1/10/2016
10  1/11/2016
11  1/12/2016
12  1/13/2016
13  1/14/2016
14  1/15/2016
15  1/16/2016
16  1/17/2016
17  1/18/2016
18  1/19/2016
19  1/20/2016
20  1/21/2016
21  1/22/2016
22  1/23/2016
23  1/24/2016
24  1/25/2016
25  1/26/2016
26  1/27/2016
27  1/28/2016
28  1/29/2016
29  1/30/2016
30  1/31/2016

In [92]:
data.describe() #only works on numerical columns

,Temperature,DewPoint,Humidity,Sea Level PressureIn,VisibilityMiles,WindSpeedMPH,CloudCover,WindDirDegrees
count,31.000000,31.000000,31.000000,31.000000,31.000000,28.000000,31.000000,31.000000
mean,34.677419,17.838710,51.677419,29.992903,9.193548,6.892857,3.129032,247.129032
std,7.639315,11.378626,11.634395,0.237237,1.939405,2.871821,2.629853,92.308086
min,20.000000,-3.000000,33.000000,29.520000,1.000000,2.000000,0.000000,34.000000
25%,29.000000,10.000000,44.500000,29.855000,9.000000,5.000000,1.000000,238.000000
50%,35.000000,18.000000,50.000000,30.010000,10.000000,6.500000,3.000000,281.000000
75%,39.500000,23.000000,55.000000,30.140000,10.000000,8.000000,4.500000,300.000000
max,50.000000,46.000000,78.000000,30.570000,10.000000,16.000000,8.000000,345.000000

In [93]:
url = "https://raw.githubusercontent.com/cs109/2014_data/master/countries.csv"
online_data = pd.read_csv(url)
online_data

       Country         Region
0      Algeria         AFRICA
1       Angola         AFRICA
2        Benin         AFRICA
3     Botswana         AFRICA
4      Burkina         AFRICA
..         ...            ...
189   Paraguay  SOUTH AMERICA
190       Peru  SOUTH AMERICA
191   Suriname  SOUTH AMERICA
192    Uruguay  SOUTH AMERICA
193  Venezuela  SOUTH AMERICA

[194 rows x 2 columns]

## **Dataframe is most commonly used object in pandas. It is a table like datastructure containing rows and columns similar to excel spreadsheet**

In [94]:
import pandas as pd
weather_data = {
    'day': ['1/1/2017','1/2/2017','1/3/2017','1/4/2017','1/5/2017','1/6/2017'],
    'temperature': [32,35,28,24,32,31],
    'windspeed': [6,7,2,7,4,2],
    'event': ['Rain', 'Sunny', 'Snow','Snow','Sunny', 'Sunny']
}
df = pd.DataFrame(weather_data)
df

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4  Sunny
5  1/6/2017           31          2  Sunny

In [95]:
df.shape # rows, columns = df.shape

(6, 4)

In [96]:
newdf = df[2:5]
newdf

        day  temperature  windspeed  event
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4  Sunny

In [97]:
newdf = df.iloc[2:5, :-1]
newdf

        day  temperature  windspeed
2  1/3/2017           28          2
3  1/4/2017           24          7
4  1/5/2017           32          4

## <font color='blue'>Rows</font>

In [98]:
df.head() # df.head(3)

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4  Sunny

In [99]:
df.tail(3) # df.tail(2)

        day  temperature  windspeed  event
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4  Sunny
5  1/6/2017           31          2  Sunny

In [100]:
df[ startindex : startindex + 3 ]

NameError: name 'startindex' is not defined

## <font color='blue'>Columns</font>

In [101]:
print(df.columns)
columnNames = df.columns.to_list()
print(columnNames)

Index(['day', 'temperature', 'windspeed', 'event'], dtype='object')
['day', 'temperature', 'windspeed', 'event']

In [102]:
df.event

0     Rain
1    Sunny
2     Snow
3     Snow
4    Sunny
5    Sunny
Name: event, dtype: object

In [103]:
eventlist = df.event.to_list()
eventlist

['Rain', 'Sunny', 'Snow', 'Snow', 'Sunny', 'Sunny']

In [104]:
twodf = df[ ['day','event']  ]
twodf

        day  event
0  1/1/2017   Rain
1  1/2/2017  Sunny
2  1/3/2017   Snow
3  1/4/2017   Snow
4  1/5/2017  Sunny
5  1/6/2017  Sunny

## <font color='blue'>Operations On DataFrame</font>

In [105]:
print(df.temperature.mean())
print(df['temperature'].std())

30.333333333333332
3.8297084310253524

In [106]:
len(df[ df['temperature'] > 30 ])

4

In [107]:
data = df.temperature.sort_values()
data

3    24
2    28
5    31
0    32
4    32
1    35
Name: temperature, dtype: int64

In [108]:
df['temperature'].mean() # Kinda doing SQL in pandas

30.333333333333332

In [109]:
df['temperature'].std()

3.8297084310253524

In [110]:
df['event'].max() # But mean() won't work since data type is string

'Sunny'

In [111]:
# get max occuring element 
df.event.value_counts()

event
Sunny    3
Snow     2
Rain     1
Name: count, dtype: int64

In [112]:
df.event.value_counts().index[0]

'Sunny'

In [113]:
df.event.value_counts()[0]

3

In [114]:
print("Max Event : " + df.event.value_counts().index[0] + " and it occured " + str( df.event.value_counts()[0]) + " times" )

Max Event : Sunny and it occured 3 times

In [115]:
df.describe()

       temperature  windspeed
count     6.000000   6.000000
mean     30.333333   4.666667
std       3.829708   2.338090
min      24.000000   2.000000
25%      28.750000   2.500000
50%      31.500000   5.000000
75%      32.000000   6.750000
max      35.000000   7.000000

**Google pandas series operations to find out list of all operations**
http://pandas.pydata.org/pandas-docs/stable/generated/pandas.Series.html

## <font color='blue'>set_index</font>

In [116]:
df.set_index("day", inplace=True)

In [117]:
df

          temperature  windspeed  event
day
1/1/2017           32          6   Rain
1/2/2017           35          7  Sunny
1/3/2017           28          2   Snow
1/4/2017           24          7   Snow
1/5/2017           32          4  Sunny
1/6/2017           31          2  Sunny

In [118]:
df.loc["1/1/2017" : "1/4/2017"]

          temperature  windspeed  event
day
1/1/2017           32          6   Rain
1/2/2017           35          7  Sunny
1/3/2017           28          2   Snow
1/4/2017           24          7   Snow

In [119]:
df.reset_index(inplace=True)
df

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4  Sunny
5  1/6/2017           31          2  Sunny

In [120]:
df

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4  Sunny
5  1/6/2017           31          2  Sunny

In [121]:
df.reset_index(inplace=True)

In [122]:
newdf = df.copy()
newdf.set_index("day" , inplace=True)

In [123]:
newdf

          index  temperature  windspeed  event
day
1/1/2017      0           32          6   Rain
1/2/2017      1           35          7  Sunny
1/3/2017      2           28          2   Snow
1/4/2017      3           24          7   Snow
1/5/2017      4           32          4  Sunny
1/6/2017      5           31          2  Sunny

In [124]:
df

   index       day  temperature  windspeed  event
0      0  1/1/2017           32          6   Rain
1      1  1/2/2017           35          7  Sunny
2      2  1/3/2017           28          2   Snow
3      3  1/4/2017           24          7   Snow
4      4  1/5/2017           32          4  Sunny
5      5  1/6/2017           31          2  Sunny

In [125]:
newdf.set_index("day" , inplace=True)

KeyError: "None of ['day'] are in the columns"

In [126]:
newdf

          index  temperature  windspeed  event
day
1/1/2017      0           32          6   Rain
1/2/2017      1           35          7  Sunny
1/3/2017      2           28          2   Snow
1/4/2017      3           24          7   Snow
1/5/2017      4           32          4  Sunny
1/6/2017      5           31          2  Sunny

In [127]:
df["NewData"] = np.arange(1,7) # [ 0,1,2,3,4,5]
df

   index       day  temperature  windspeed  event  NewData
0      0  1/1/2017           32          6   Rain        1
1      1  1/2/2017           35          7  Sunny        2
2      2  1/3/2017           28          2   Snow        3
3      3  1/4/2017           24          7   Snow        4
4      4  1/5/2017           32          4  Sunny        5
5      5  1/6/2017           31          2  Sunny        6

In [128]:
mylist = []
for i in df.temperature:
    if i == 32:
        mylist.append(True)
    else:
        mylist.append(False)
df["Check"] = mylist

In [129]:
df

   index       day  temperature  windspeed  event  NewData  Check
0      0  1/1/2017           32          6   Rain        1   True
1      1  1/2/2017           35          7  Sunny        2  False
2      2  1/3/2017           28          2   Snow        3  False
3      3  1/4/2017           24          7   Snow        4  False
4      4  1/5/2017           32          4  Sunny        5   True
5      5  1/6/2017           31          2  Sunny        6  False

In [130]:
df["Names"] = np.array(["Ahmed", "Ali", "Omar" , "Emad" , "Anas" , "Amr" ])
df

   index       day  temperature  windspeed  event  NewData  Check  Names
0      0  1/1/2017           32          6   Rain        1   True  Ahmed
1      1  1/2/2017           35          7  Sunny        2  False    Ali
2      2  1/3/2017           28          2   Snow        3  False   Omar
3      3  1/4/2017           24          7   Snow        4  False   Emad
4      4  1/5/2017           32          4  Sunny        5   True   Anas
5      5  1/6/2017           31          2  Sunny        6  False    Amr

In [131]:
df.reset_index(inplace=True)
df.drop("event", inplace=True, axis= 1)
df

   level_0  index       day  temperature  windspeed  NewData  Check  Names
0        0      0  1/1/2017           32          6        1   True  Ahmed
1        1      1  1/2/2017           35          7        2  False    Ali
2        2      2  1/3/2017           28          2        3  False   Omar
3        3      3  1/4/2017           24          7        4  False   Emad
4        4      4  1/5/2017           32          4        5   True   Anas
5        5      5  1/6/2017           31          2        6  False    Amr

In [132]:
df.drop("index", inplace=True, axis = 1)

In [133]:
df

   level_0       day  temperature  windspeed  NewData  Check  Names
0        0  1/1/2017           32          6        1   True  Ahmed
1        1  1/2/2017           35          7        2  False    Ali
2        2  1/3/2017           28          2        3  False   Omar
3        3  1/4/2017           24          7        4  False   Emad
4        4  1/5/2017           32          4        5   True   Anas
5        5  1/6/2017           31          2        6  False    Amr

In [134]:
#df.reset_index(inplace=True)
df.set_index("temperature", inplace=True)

In [135]:
df

             level_0       day  windspeed  NewData  Check  Names
temperature
32                 0  1/1/2017          6        1   True  Ahmed
35                 1  1/2/2017          7        2  False    Ali
28                 2  1/3/2017          2        3  False   Omar
24                 3  1/4/2017          7        4  False   Emad
32                 4  1/5/2017          4        5   True   Anas
31                 5  1/6/2017          2        6  False    Amr

In [136]:
df.loc[32]

             level_0       day  windspeed  NewData  Check  Names
temperature
32                 0  1/1/2017          6        1   True  Ahmed
32                 4  1/5/2017          4        5   True   Anas

In [137]:
weather_data = {
    'day': ['1/1/2017','1/2/2017','1/3/2017','1/4/2017','1/5/2017','1/6/2017'],
    'temperature': [32,35,28,24,32,31],
    'windspeed': [6,7,2,7,4,2],
    'event': ['Rain', 'Sunny', 'Snow','Snow','Sunny', 'Sunny']
}
df = pd.DataFrame(weather_data)
df.set_index('event',inplace=True) # this is kind of building a hash map using event as a key
df

            day  temperature  windspeed
event
Rain   1/1/2017           32          6
Sunny  1/2/2017           35          7
Snow   1/3/2017           28          2
Snow   1/4/2017           24          7
Sunny  1/5/2017           32          4
Sunny  1/6/2017           31          2

In [138]:
df

            day  temperature  windspeed
event
Rain   1/1/2017           32          6
Sunny  1/2/2017           35          7
Snow   1/3/2017           28          2
Snow   1/4/2017           24          7
Sunny  1/5/2017           32          4
Sunny  1/6/2017           31          2

In [139]:
columns = []
data = dict()

num = int(input("please enter the number of columns"))
while(num > 0):
    columns.append(input("please enter the column name: "))
    num -=1

for i in columns:
    data[i] = []

rows = int(input("please enter the number of rows: "))
while(rows > 0):
    for i in data:
        value = input(f"please enter the value of {i}: ")
        data[i].append(value)

    rows-=1
dataframe = pd.DataFrame(data)
dataframe

please enter the number of columns

ValueError: invalid literal for int() with base 10: ''

In [144]:
# fillna ( x ) is filling every Non value with a x value
df = pd.read_csv('nyc_weather.csv')
df = df.fillna(0)
df

,EST,Temperature,DewPoint,Humidity,Sea Level PressureIn,VisibilityMiles,WindSpeedMPH,PrecipitationIn,CloudCover,Events,WindDirDegrees
0,1/1/2016,38,23,52,30.03,10,8.0,0,5,0,281
1,1/2/2016,36,18,46,30.02,10,7.0,0,3,0,275
2,1/3/2016,40,21,47,29.86,10,8.0,0,1,0,277
3,1/4/2016,25,9,44,30.05,10,9.0,0,3,0,345
4,1/5/2016,20,-3,41,30.57,10,5.0,0,0,0,333
5,1/6/2016,33,4,35,30.50,10,4.0,0,0,0,259
6,1/7/2016,39,11,33,30.28,10,2.0,0,3,0,293
7,1/8/2016,39,29,64,30.20,10,4.0,0,8,0,79
8,1/9/2016,44,38,77,30.16,9,8.0,T,8,Rain,76
9,1/10/2016,50,46,71,29.59,4,0.0,1.8,7,Rain,109
10,1/11/2016,33,8,37,29.92,10,0.0,0,1,0,289
11,1/12/2016,35,15,53,29.85,10,6.0,T,4,0,235
12,1/13/2016,26,4,42,29.94,10,10.0,0,0,0,284
13,1/14/2016,30,12,47,29.95,10,5.0,T,7,0,266
14,1/15/2016,43,31,62,29.82,9,5.0,T,2,0,101
15,1/16/2016,47,37,70,29.52,8,7.0,0.24,7,Rain,340
16,1/17/2016,36,23,66,29.78,8,6.0,0.05,6,Fog-Snow,345
17,1/18/2016,25,6,53,29.83,9,12.0,T,2,Snow,293
18,1/19/2016,22,3,42,30.03,10,11.0,0,1,0,293
19,1/20/2016,32,15,49,30.13,10,6.0,0,2,0,302
20,1/21/2016,31,11,45,30.15,10,6.0,0,1,0,312
21,1/22/2016,26,6,41,30.21,9,0.0,0.01,3,Snow,34
22,1/23/2016,26,21,78,29.77,1,16.0,2.31,8,Fog-Snow,42
23,1/24/2016,28,11,53,29.92,8,6.0,T,3,Snow,327
24,1/25/2016,34,18,54,30.25,10,3.0,0,2,0,286
25,1/26/2016,43,29,56,30.03,10,7.0,0,2,0,244
26,1/27/2016,41,22,45,30.03,10,7.0,T,3,Rain,311
27,1/28/2016,37,20,51,29.90,10,5.0,0,1,0,234
28,1/29/2016,36,21,50,29.58,10,8.0,0,4,0,298
29,1/30/2016,34,16,46,30.01,10,7.0,0,0,0,257
30,1/31/2016,46,28,52,29.90,10,5.0,0,0,0,241

### Read CSV</color>

In [145]:
#normal read
df = pd.read_csv("stock_data.csv")
df

  tickers            eps  revenue price         people
0   GOOGL          27.82       87   845     larry page
1     WMT           4.61      484    65           n.a.
2    MSFT             -1       85    64     bill gates
3    RIL   not available       50  1023  mukesh ambani
4    TATA            5.6       -1  n.a.     ratan tata

In [146]:
# read without specific row 

df = pd.read_csv("stock_data.csv", skiprows=1)
df

  GOOGL          27.82   87   845     larry page
0   WMT           4.61  484    65           n.a.
1  MSFT             -1   85    64     bill gates
2  RIL   not available   50  1023  mukesh ambani
3  TATA            5.6   -1  n.a.     ratan tata

In [148]:
# stop making the first row is the deafult headers
df = pd.read_csv("stock_data.csv", header=None)
df

         0              1        2      3              4
0  tickers            eps  revenue  price         people
1    GOOGL          27.82       87    845     larry page
2      WMT           4.61      484     65           n.a.
3     MSFT             -1       85     64     bill gates
4     RIL   not available       50   1023  mukesh ambani
5     TATA            5.6       -1   n.a.     ratan tata

In [153]:
# making new headers names
df = pd.read_csv("stock_data.csv", header=None, names = ["ali","saeed","farag","price","people"])
df

       ali          saeed    farag  price         people
0  tickers            eps  revenue  price         people
1    GOOGL          27.82       87    845     larry page
2      WMT           4.61      484     65           n.a.
3     MSFT             -1       85     64     bill gates
4     RIL   not available       50   1023  mukesh ambani
5     TATA            5.6       -1   n.a.     ratan tata

In [154]:
# calling just two rows

df = pd.read_csv("stock_data.csv",  nrows=2)
df

  tickers    eps  revenue  price      people
0   GOOGL  27.82       87    845  larry page
1     WMT   4.61      484     65        n.a.

In [155]:
# giving the reading process another NaN values to check
df = pd.read_csv("stock_data.csv", na_values=["n.a.", "not available"]) 
df

  tickers    eps  revenue   price         people
0   GOOGL  27.82       87   845.0     larry page
1     WMT   4.61      484    65.0            NaN
2    MSFT  -1.00       85    64.0     bill gates
3    RIL     NaN       50  1023.0  mukesh ambani
4    TATA   5.60       -1     NaN     ratan tata

In [163]:
# and here u can change NaN values with fillna
df = df.fillna("zero")
df

  tickers    eps  revenue   price         people
0   GOOGL  27.82       87   845.0     larry page
1     WMT   4.61      484    65.0           zero
2    MSFT   -1.0       85    64.0     bill gates
3    RIL    zero       50  1023.0  mukesh ambani
4    TATA    5.6       -1    zero     ratan tata

In [164]:
# u can choose what colum have what non value

df = pd.read_csv("stock_data.csv",  na_values={
        'eps': ['not available'],
        'revenue': [-1],
        'people': ['not available','n.a.']
    })
df

  tickers    eps  revenue price         people
0   GOOGL  27.82     87.0   845     larry page
1     WMT   4.61    484.0    65            NaN
2    MSFT  -1.00     85.0    64     bill gates
3    RIL     NaN     50.0  1023  mukesh ambani
4    TATA   5.60      NaN  n.a.     ratan tata

### How to write in csv

In [166]:
df.to_csv("newdata.csv", index=True)

### Read Excel

In [167]:
df = pd.read_excel("stock_data.xlsx","Sheet1")
df

  tickers            eps  revenue price         people
0   GOOGL          27.82       87   845     larry page
1     WMT           4.61      484    65           n.a.
2    MSFT             -1       85    64     bill gates
3    RIL   not available       50  1023  mukesh ambani
4    TATA            5.6       -1  n.a.     ratan tata

**Write two dataframes to two separate sheets in excel**

In [168]:
df_stocks = pd.DataFrame({
    'tickers': ['GOOGL', 'WMT', 'MSFT'],
    'price': [845, 65, 64 ],
    'pe': [30.37, 14.26, 30.97],
    'eps': [27.82, 4.61, 2.12]
})

In [169]:
df_stocks

  tickers  price     pe    eps
0   GOOGL    845  30.37  27.82
1     WMT     65  14.26   4.61
2    MSFT     64  30.97   2.12

#### write in excell

In [172]:
df_weather =  pd.DataFrame({
    'day': ['1/1/2017','1/2/2017','1/3/2017'],
    'temperature': [32,35,28],
    'event': ['Rain', 'Sunny', 'Snow']
})

In [173]:
df_weather

        day  temperature  event
0  1/1/2017           32   Rain
1  1/2/2017           35  Sunny
2  1/3/2017           28   Snow

In [174]:
with pd.ExcelWriter('stocks_weather.xlsx') as writer:
    df_stocks.to_excel(writer, sheet_name="stocks")
    df_weather.to_excel(writer, sheet_name="weather")

In [175]:
df_stocks.to_excel('a.xlsx', sheet_name="stocks")
df_weather.to_excel('a.xlsx', sheet_name="weather")

### Handling Missing Data - fillna, interpolate, dropna

In [3]:
df = pd.read_csv("weather_data.csv", parse_dates=['day'])
df

         day  temperature  windspeed   event
0 2017-01-01         32.0        6.0    Rain
1 2017-01-04          NaN        9.0   Sunny
2 2017-01-05         28.0        NaN    Snow
3 2017-01-06          NaN        7.0     NaN
4 2017-01-07         32.0        NaN    Rain
5 2017-01-08          NaN        NaN   Sunny
6 2017-01-09          NaN        NaN     NaN
7 2017-01-10         34.0        8.0  Cloudy
8 2017-01-11         40.0       12.0   Sunny

In [4]:
type(df.day[0])

pandas._libs.tslibs.timestamps.Timestamp

## <font color="blue">fillna</font>

<font color="purple">**Fill all NaN with one specific value**</font>

In [7]:
new_df = df.fillna(888)
new_df

         day  temperature  windspeed   event
0 2017-01-01         32.0        6.0    Rain
1 2017-01-04        888.0        9.0   Sunny
2 2017-01-05         28.0      888.0    Snow
3 2017-01-06        888.0        7.0     888
4 2017-01-07         32.0      888.0    Rain
5 2017-01-08        888.0      888.0   Sunny
6 2017-01-09        888.0      888.0     888
7 2017-01-10         34.0        8.0  Cloudy
8 2017-01-11         40.0       12.0   Sunny

<font color="purple">**Fill na using column names and dict**</font>

In [8]:
new_df = df.fillna({
        'temperature': 0,
        'windspeed': df["windspeed"].mean(),
        'event': 'No event'
    })
new_df

         day  temperature  windspeed     event
0 2017-01-01         32.0        6.0      Rain
1 2017-01-04          0.0        9.0     Sunny
2 2017-01-05         28.0        8.4      Snow
3 2017-01-06          0.0        7.0  No event
4 2017-01-07         32.0        8.4      Rain
5 2017-01-08          0.0        8.4     Sunny
6 2017-01-09          0.0        8.4  No event
7 2017-01-10         34.0        8.0    Cloudy
8 2017-01-11         40.0       12.0     Sunny

<font color="purple">**Use method to determine how to fill na values**</font>

In [9]:
# ffill front fill
new_df = df.fillna(method="ffill")
new_df

         day  temperature  windspeed   event
0 2017-01-01         32.0        6.0    Rain
1 2017-01-04         32.0        9.0   Sunny
2 2017-01-05         28.0        9.0    Snow
3 2017-01-06         28.0        7.0    Snow
4 2017-01-07         32.0        7.0    Rain
5 2017-01-08         32.0        7.0   Sunny
6 2017-01-09         32.0        7.0   Sunny
7 2017-01-10         34.0        8.0  Cloudy
8 2017-01-11         40.0       12.0   Sunny

In [10]:
#bfill backword fill
new_df = df.fillna(method="bfill")
new_df

         day  temperature  windspeed   event
0 2017-01-01         32.0        6.0    Rain
1 2017-01-04         28.0        9.0   Sunny
2 2017-01-05         28.0        7.0    Snow
3 2017-01-06         32.0        7.0    Rain
4 2017-01-07         32.0        8.0    Rain
5 2017-01-08         34.0        8.0   Sunny
6 2017-01-09         34.0        8.0  Cloudy
7 2017-01-10         34.0        8.0  Cloudy
8 2017-01-11         40.0       12.0   Sunny

<font color="purple">**Use of axis**</font>

In [11]:
new_df = df.fillna(method="bfill", axis="columns") # axis is either "index" or "columns"
new_df

         day temperature windspeed   event
0 2017-01-01        32.0       6.0    Rain
1 2017-01-04         9.0       9.0   Sunny
2 2017-01-05        28.0      Snow    Snow
3 2017-01-06         7.0       7.0     NaN
4 2017-01-07        32.0      Rain    Rain
5 2017-01-08       Sunny     Sunny   Sunny
6 2017-01-09         NaT       NaT     NaT
7 2017-01-10        34.0       8.0  Cloudy
8 2017-01-11        40.0      12.0   Sunny

<font color="purple">**limit parameter**</font>

In [14]:
# if there more than to NaN value the method wannt work
new_df = df.fillna(method="ffill",limit=2)
new_df

         day  temperature  windspeed   event
0 2017-01-01         32.0        6.0    Rain
1 2017-01-04         32.0        9.0   Sunny
2 2017-01-05         28.0        9.0    Snow
3 2017-01-06         28.0        7.0    Snow
4 2017-01-07         32.0        7.0    Rain
5 2017-01-08         32.0        7.0   Sunny
6 2017-01-09         32.0        NaN   Sunny
7 2017-01-10         34.0        8.0  Cloudy
8 2017-01-11         40.0       12.0   Sunny

### <font color="blue">interpolate</font>

In [15]:
# gives mean values to the NaN Values
new_df = df.interpolate()
new_df

         day  temperature  windspeed   event
0 2017-01-01    32.000000       6.00    Rain
1 2017-01-04    30.000000       9.00   Sunny
2 2017-01-05    28.000000       8.00    Snow
3 2017-01-06    30.000000       7.00     NaN
4 2017-01-07    32.000000       7.25    Rain
5 2017-01-08    32.666667       7.50   Sunny
6 2017-01-09    33.333333       7.75     NaN
7 2017-01-10    34.000000       8.00  Cloudy
8 2017-01-11    40.000000      12.00   Sunny

In [16]:
# if u putted day as an index u can use it as a key to detremine Right values
df.set_index("day", inplace=True)
new_df = df.interpolate(method="time") 
new_df

            temperature  windspeed   event
day
2017-01-01    32.000000       6.00    Rain
2017-01-04    29.000000       9.00   Sunny
2017-01-05    28.000000       8.00    Snow
2017-01-06    30.000000       7.00     NaN
2017-01-07    32.000000       7.25    Rain
2017-01-08    32.666667       7.50   Sunny
2017-01-09    33.333333       7.75     NaN
2017-01-10    34.000000       8.00  Cloudy
2017-01-11    40.000000      12.00   Sunny

In [17]:
new_df.temperature = new_df.temperature.astype(int)
new_df

            temperature  windspeed   event
day
2017-01-01           32       6.00    Rain
2017-01-04           29       9.00   Sunny
2017-01-05           28       8.00    Snow
2017-01-06           30       7.00     NaN
2017-01-07           32       7.25    Rain
2017-01-08           32       7.50   Sunny
2017-01-09           33       7.75     NaN
2017-01-10           34       8.00  Cloudy
2017-01-11           40      12.00   Sunny

**Notice that in above temperature on 2017-01-04 is 29 instead of 30 (in plain linear interpolate)**

**There are many other methods for interpolation such as quadratic, piecewise_polynomial, cubic etc. 
Just google "dataframe interpolate" to see complete documentation**

### <font color="blue">dropna</font>

In [18]:
# if there NaN value u can remove its raw using dropna Method
new_df = df.dropna()
new_df

            temperature  windspeed   event
day
2017-01-01         32.0        6.0    Rain
2017-01-10         34.0        8.0  Cloudy
2017-01-11         40.0       12.0   Sunny

In [19]:
# if  want to make conditions u can use how='all' to make it remove just when all values = NaN
new_df = df.dropna(how='all')
new_df

            temperature  windspeed   event
day
2017-01-01         32.0        6.0    Rain
2017-01-04          NaN        9.0   Sunny
2017-01-05         28.0        NaN    Snow
2017-01-06          NaN        7.0     NaN
2017-01-07         32.0        NaN    Rain
2017-01-08          NaN        NaN   Sunny
2017-01-10         34.0        8.0  Cloudy
2017-01-11         40.0       12.0   Sunny

In [21]:
# or u can give it at least how much values can be NaN
new_df = df.dropna(thresh=2) 
new_df

            temperature  windspeed   event
day
2017-01-01         32.0        6.0    Rain
2017-01-04          NaN        9.0   Sunny
2017-01-05         28.0        NaN    Snow
2017-01-07         32.0        NaN    Rain
2017-01-10         34.0        8.0  Cloudy
2017-01-11         40.0       12.0   Sunny

In [31]:
#drop columns
newdf = df.drop(["event","windspeed"], axis = 1) 
newdf

            temperature
day
2017-01-01         32.0
2017-01-04          NaN
2017-01-05         28.0
2017-01-06          NaN
2017-01-07         32.0
2017-01-08          NaN
2017-01-09          NaN
2017-01-10         34.0
2017-01-11         40.0

### <font color="blue">Inserting Missing Dates</font>

In [28]:
#if u need to make ur data full of all days as an example u can use this method to re index the table
dt = pd.date_range("01-01-2017","1-11-2017")
print(dt)
idx = pd.DatetimeIndex(dt)
df.reindex(idx)

# NAT --> not a time ( datatype = datetime )

DatetimeIndex(['2017-01-01', '2017-01-02', '2017-01-03', '2017-01-04',
               '2017-01-05', '2017-01-06', '2017-01-07', '2017-01-08',
               '2017-01-09', '2017-01-10', '2017-01-11'],
              dtype='datetime64[ns]', freq='D')

            temperature  windspeed   event
2017-01-01         32.0        6.0    Rain
2017-01-02          NaN        NaN     NaN
2017-01-03          NaN        NaN     NaN
2017-01-04          NaN        9.0   Sunny
2017-01-05         28.0        NaN    Snow
2017-01-06          NaN        7.0     NaN
2017-01-07         32.0        NaN    Rain
2017-01-08          NaN        NaN   Sunny
2017-01-09          NaN        NaN     NaN
2017-01-10         34.0        8.0  Cloudy
2017-01-11         40.0       12.0   Sunny

### Handling Missing Data - replace method

In [40]:
import numpy as np
df = pd.read_csv("weather_data.csv")
df

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017       -99999          7  Sunny
2  1/3/2017           28     -99999   Snow
3  1/4/2017       -99999          7      0
4  1/5/2017           32     -99999   Rain
5  1/6/2017           31          2  Sunny
6  1/6/2017           34          5      0

**Replacing single value**

In [41]:
# relpeacing every 5 value in the coulmn to -99999
new_df = df.replace(-99999, value=6.0)
new_df

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017            6          7  Sunny
2  1/3/2017           28          6   Snow
3  1/4/2017            6          7      0
4  1/5/2017           32          6   Rain
5  1/6/2017           31          2  Sunny
6  1/6/2017           34          5      0

**Replacing list with single value**

In [42]:
new_df = df.replace(to_replace=[-99999,-88888, 10, '0'], value=5)
new_df

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017            5          7  Sunny
2  1/3/2017           28          5   Snow
3  1/4/2017            5          7      5
4  1/5/2017           32          5   Rain
5  1/6/2017           31          2  Sunny
6  1/6/2017           34          5      5

**Replacing per column**

In [43]:
new_df = df.replace({
        'temperature': -99999,
        'windspeed': -99999,
        'day': '1/1/2017',
        'event': '0'
    }, np.nan)
new_df

        day  temperature  windspeed  event
0       NaN         32.0        6.0   Rain
1  1/2/2017          NaN        7.0  Sunny
2  1/3/2017         28.0        NaN   Snow
3  1/4/2017          NaN        7.0    NaN
4  1/5/2017         32.0        NaN   Rain
5  1/6/2017         31.0        2.0  Sunny
6  1/6/2017         34.0        5.0    NaN

**Replacing by using mapping**

In [44]:
new_df = df.replace({
        -99999: np.nan,
        '0': 'Sunny',
    })
new_df

        day  temperature  windspeed  event
0  1/1/2017         32.0        6.0   Rain
1  1/2/2017          NaN        7.0  Sunny
2  1/3/2017         28.0        NaN   Snow
3  1/4/2017          NaN        7.0  Sunny
4  1/5/2017         32.0        NaN   Rain
5  1/6/2017         31.0        2.0  Sunny
6  1/6/2017         34.0        5.0  Sunny

**Regex**

In [45]:
# when windspeed is 6 mph, 7 mph etc. & temperature is 32 F, 28 F etc.
new_df = df.replace({'temperature': '[A-Za-z]', 'windspeed': '[a-z]'},'', regex=True) 
new_df

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017       -99999          7  Sunny
2  1/3/2017           28     -99999   Snow
3  1/4/2017       -99999          7      0
4  1/5/2017           32     -99999   Rain
5  1/6/2017           31          2  Sunny
6  1/6/2017           34          5      0

**Replacing list with another list**

In [46]:
df = pd.DataFrame({
    'student': ['rob', 'maya', 'parthiv', 'tom', 'julian', 'erica'],
     'score': ['exceptional','average', 'good', 'poor', 'average', 'exceptional']
})
df

   student        score
0      rob  exceptional
1     maya      average
2  parthiv         good
3      tom         poor
4   julian      average
5    erica  exceptional

In [47]:
df.score.value_counts()

score
exceptional    2
average        2
good           1
poor           1
Name: count, dtype: int64

In [48]:
df.replace(['poor', 'average', 'good', 'exceptional'], [2,4,10,30])

   student  score
0      rob     30
1     maya      4
2  parthiv     10
3      tom      2
4   julian      4
5    erica     30

### Pandas Group By

In [59]:
df = pd.read_csv("weather_by_cities.csv")
df

         day      city  temperature  windspeed   event
0   1/1/2017  new york           32          6    Rain
1   1/2/2017  new york           36          7   Sunny
2   1/3/2017  new york           28         12    Snow
3   1/4/2017  new york           33          7   Sunny
4   1/1/2017    mumbai           90          5   Sunny
5   1/2/2017    mumbai           85         12     Fog
6   1/3/2017    mumbai           87         15     Fog
7   1/4/2017    mumbai           92          5    Rain
8   1/1/2017     paris           45         20   Sunny
9   1/2/2017     paris           50         13  Cloudy
10  1/3/2017     paris           54          8  Cloudy
11  1/4/2017     paris           42         10  Cloudy

In [60]:
g = df.groupby("city") # column name
g

In [61]:
newyork = g.get_group("new york")
newyork

        day      city  temperature  windspeed  event
0  1/1/2017  new york           32          6   Rain
1  1/2/2017  new york           36          7  Sunny
2  1/3/2017  new york           28         12   Snow
3  1/4/2017  new york           33          7  Sunny

In [69]:
g.max()

               day  temperature  windspeed  event
city
mumbai    1/4/2017           92         15  Sunny
new york  1/4/2017           36         12  Sunny
paris     1/4/2017           54         20  Sunny

In [70]:
g.max().temperature

city
mumbai      92
new york    36
paris       54
Name: temperature, dtype: int64

In [71]:
g.size()

city
mumbai      4
new york    4
paris       4
dtype: int64

In [72]:
g.count()

          day  temperature  windspeed  event
city
mumbai      4            4          4      4
new york    4            4          4      4
paris       4            4          4      4

For this you need to write custom grouping function and pass that to groupby

In [77]:
def grouper(df, idx, col): 
    if 2 <= df[col].loc[idx] <= 5:
        return '2-5'
    elif 6 <= df[col].loc[idx] <= 10:
        return '6-10'
    else:
        return 'others'

In [78]:
g = df.groupby(lambda x : grouper(df, x, 'windspeed'))
g

In [79]:
g.get_group("others")

        day      city  temperature  windspeed   event
2  1/3/2017  new york           28         12    Snow
5  1/2/2017    mumbai           85         12     Fog
6  1/3/2017    mumbai           87         15     Fog
8  1/1/2017     paris           45         20   Sunny
9  1/2/2017     paris           50         13  Cloudy

In [80]:
g.get_group("6-10")

         day      city  temperature  windspeed   event
0   1/1/2017  new york           32          6    Rain
1   1/2/2017  new york           36          7   Sunny
3   1/4/2017  new york           33          7   Sunny
10  1/3/2017     paris           54          8  Cloudy
11  1/4/2017     paris           42         10  Cloudy

In [81]:
g.get_group("2-5")

        day    city  temperature  windspeed  event
4  1/1/2017  mumbai           90          5  Sunny
7  1/4/2017  mumbai           92          5   Rain

## <font color='blue'>Basic Concatenation</font>

In [82]:
india_weather = pd.DataFrame({
    "city": ["mumbai","delhi","banglore"],
    "temperature": [32,45,30],
    "humidity": [80, 60, 78]
})
india_weather

       city  temperature  humidity
0    mumbai           32        80
1     delhi           45        60
2  banglore           30        78

In [83]:
us_weather = pd.DataFrame({
    "city": ["new york","chicago","orlando"],
    "temperature": [21,14,35],
    "humidity": [68, 65, 75]
})
us_weather

       city  temperature  humidity
0  new york           21        68
1   chicago           14        65
2   orlando           35        75

In [91]:
df = pd.concat([india_weather, us_weather])
df

       city  temperature  humidity
0    mumbai           32        80
1     delhi           45        60
2  banglore           30        78
0  new york           21        68
1   chicago           14        65
2   orlando           35        75

## <font color='blue'>Ignore Index</font>

In [92]:
df = pd.concat([india_weather, us_weather], ignore_index=True)
df

       city  temperature  humidity
0    mumbai           32        80
1     delhi           45        60
2  banglore           30        78
3  new york           21        68
4   chicago           14        65
5   orlando           35        75

In [93]:
df.to_csv("concatinatedDFs.csv" , index=False)

## <font color='blue'>Concatenation And Keys</font>

In [94]:
df = pd.concat([india_weather, us_weather], keys=["india", "us"])
df

             city  temperature  humidity
india 0    mumbai           32        80
      1     delhi           45        60
      2  banglore           30        78
us    0  new york           21        68
      1   chicago           14        65
      2   orlando           35        75

In [95]:
df.loc["us"] #location

       city  temperature  humidity
0  new york           21        68
1   chicago           14        65
2   orlando           35        75

In [96]:
df.loc["india"]

       city  temperature  humidity
0    mumbai           32        80
1     delhi           45        60
2  banglore           30        78

In [97]:
df.to_csv("newdf.csv" , index_label=True)

## <font color='blue'>Concatenation Using Index</font>

In [98]:
temperature_df = pd.DataFrame({
    "city": ["mumbai","delhi","banglore"],
    "temperature": [32,45,30],
}, index=[4,5,2])
temperature_df

       city  temperature
4    mumbai           32
5     delhi           45
2  banglore           30

In [99]:
windspeed_df = pd.DataFrame({
    "city": ["delhi","mumbai"],
    "windspeed": [7,12],
}, index=[1,0])
windspeed_df

     city  windspeed
1   delhi          7
0  mumbai         12

In [100]:
df = pd.concat([temperature_df,windspeed_df])
df

       city  temperature  windspeed
4    mumbai         32.0        NaN
5     delhi         45.0        NaN
2  banglore         30.0        NaN
1     delhi          NaN        7.0
0    mumbai          NaN       12.0

* Task : How to sort dataframe by index, how to sort dataframe by specific column

In [101]:
df = pd.concat([temperature_df,windspeed_df], axis= 1)
df

       city  temperature    city  windspeed
4    mumbai         32.0     NaN        NaN
5     delhi         45.0     NaN        NaN
2  banglore         30.0     NaN        NaN
1       NaN          NaN   delhi        7.0
0       NaN          NaN  mumbai       12.0

## <font color='blue'>Concatenate dataframe with series</font>

In [102]:
s = pd.Series(["Humid","Dry","Rain"], name="event")

In [103]:
df = pd.concat([df,s],axis=1)
df

       city  temperature    city  windspeed  event
4    mumbai         32.0     NaN        NaN    NaN
5     delhi         45.0     NaN        NaN    NaN
2  banglore         30.0     NaN        NaN   Rain
1       NaN          NaN   delhi        7.0    Dry
0       NaN          NaN  mumbai       12.0  Humid

## Pandas Merge Tutorial

## <font color='blue'>Basic Merge Using a Dataframe Column</font>

In [105]:

df1 = pd.DataFrame({
    "city": ["new york","chicago","orlando"],
    "temperature": [21,14,35],
})
df2 = pd.DataFrame({
    "city": ["chicago","new york","orlando", "California"],
    "humidity": [65,68,75, 56],
})

In [107]:
df3 = pd.merge(df1, df2, on="city")
df3

       city  temperature  humidity
0  new york           21        68
1   chicago           14        65
2   orlando           35        75

## <font color='blue'>Type Of DataBase Joins</font>

In [108]:
df1 = pd.DataFrame({
    "city": ["new york","chicago","orlando", "baltimore"],
    "temperature": [21,14,35, 38],
})
df1

        city  temperature
0   new york           21
1    chicago           14
2    orlando           35
3  baltimore           38

In [109]:
df2 = pd.DataFrame({
    "city": ["chicago","new york","san diego"],
    "humidity": [65,68,71],
})
df2

        city  humidity
0    chicago        65
1   new york        68
2  san diego        71

In [110]:
df3=pd.merge(df1,df2,on="city",how="inner")
df3

       city  temperature  humidity
0  new york           21        68
1   chicago           14        65

In [111]:
df3=pd.merge(df1,df2,on="city",how="outer")
df3

        city  temperature  humidity
0   new york         21.0      68.0
1    chicago         14.0      65.0
2    orlando         35.0       NaN
3  baltimore         38.0       NaN
4  san diego          NaN      71.0

In [112]:
df3 = pd.merge(df1,df2,on="city",how="left")
df3

        city  temperature  humidity
0   new york           21      68.0
1    chicago           14      65.0
2    orlando           35       NaN
3  baltimore           38       NaN

In [113]:
df3=pd.merge(df1,df2,on="city",how="right")
df3

        city  temperature  humidity
0    chicago         14.0        65
1   new york         21.0        68
2  san diego          NaN        71

## <font color='blue'>indicator flag</font>

In [114]:
df3=pd.merge(df1,df2,on="city",how="outer",indicator=True)
df3

        city  temperature  humidity      _merge
0   new york         21.0      68.0        both
1    chicago         14.0      65.0        both
2    orlando         35.0       NaN   left_only
3  baltimore         38.0       NaN   left_only
4  san diego          NaN      71.0  right_only

## <font color='blue'>suffixes</font>

In [11]:
df1 = pd.DataFrame({
    "city": ["new york","chicago","orlando", "baltimore"],
    "temperature": [21,14,35,38],
    "humidity": [65,68,71, 75]
})
df1

        city  temperature  humidity
0   new york           21        65
1    chicago           14        68
2    orlando           35        71
3  baltimore           38        75

In [12]:
df2 = pd.DataFrame({
    "city": ["chicago","new york","san diego"],
    "temperature": [21,14,35],
    "humidity": [65,68,71]
})
df2

        city  temperature  humidity
0    chicago           21        65
1   new york           14        68
2  san diego           35        71

In [13]:
df3= pd.merge(df1,df2,on="city",how="outer", suffixes=('_first','_second'))
df3

,city,temperature_first,humidity_first,temperature_second,humidity_second
0,new york,21.0,65.0,14.0,68.0
1,chicago,14.0,68.0,21.0,65.0
2,orlando,35.0,71.0,NaN,NaN
3,baltimore,38.0,75.0,NaN,NaN
4,san diego,NaN,NaN,35.0,71.0

In [13]:
df3.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   city         5 non-null      object
 1   temperature  4 non-null      float64
 2   humidity     3 non-null      float64
 3   _merge       5 non-null      category
dtypes: category(1), float64(2), object(1)
memory usage: 297.0+ bytes

## <font color='blue'>join</font>

In [115]:
df1 = pd.DataFrame({
    "city": ["new york","chicago","orlando"],
    "temperature": [21,14,35],
})
df1.set_index('city',inplace=True)
df1

          temperature
city
new york           21
chicago            14
orlando            35

In [116]:
df2 = pd.DataFrame({
    "city": ["chicago","new york","orlando"],
    "humidity": [65,68,75],
})
df2.set_index('city',inplace=True)
df2

          humidity
city
chicago         65
new york        68
orlando         75

<h1 style="color:blue">Pivot basics</h1>

In [1]:
import pandas as pd
import numpy as np
df = pd.read_csv("weather.csv")
df

       date      city  temperature  humidity
0  5/1/2017  new york           65        56
1  5/2/2017  new york           66        58
2  5/3/2017  new york           68        60
3  5/1/2017    mumbai           75        80
4  5/2/2017    mumbai           78        83
5  5/3/2017    mumbai           82        85
6  5/1/2017   beijing           80        26
7  5/2/2017   beijing           77        30
8  5/3/2017   beijing           79        35

In [2]:
df.pivot(index='city',columns='date')

         temperature                   humidity
date        5/1/2017 5/2/2017 5/3/2017 5/1/2017 5/2/2017 5/3/2017
city
beijing           80       77       79       26       30       35
mumbai            75       78       82       80       83       85
new york          65       66       68       56       58       60

In [3]:
df.pivot(index='city',columns='date')["temperature"]

date      5/1/2017  5/2/2017  5/3/2017
city
beijing         80        77        79
mumbai          75        78        82
new york        65        66        68

In [4]:
df.pivot(index='city',columns='date')["temperature"].to_csv("pivot.csv")

In [5]:
df.pivot(index='city',columns='date',values="humidity") # return a dataframe

date      5/1/2017  5/2/2017  5/3/2017
city
beijing         26        30        35
mumbai          80        83        85
new york        56        58        60

In [6]:
df.pivot(index='date',columns='city')

         temperature                 humidity
city         beijing mumbai new york  beijing mumbai new york
date
5/1/2017          80     75       65       26     80       56
5/2/2017          77     78       66       30     83       58
5/3/2017          79     82       68       35     85       60

In [7]:
df.pivot(index='date',columns='city').to_csv("pivotCity.csv")

In [8]:
df.pivot(index='humidity',columns='city')

              date                     temperature
city       beijing    mumbai  new york     beijing mumbai new york
humidity
26        5/1/2017       NaN       NaN        80.0    NaN      NaN
30        5/2/2017       NaN       NaN        77.0    NaN      NaN
35        5/3/2017       NaN       NaN        79.0    NaN      NaN
56             NaN       NaN  5/1/2017         NaN    NaN     65.0
58             NaN       NaN  5/2/2017         NaN    NaN     66.0
60             NaN       NaN  5/3/2017         NaN    NaN     68.0
80             NaN  5/1/2017       NaN         NaN   75.0      NaN
83             NaN  5/2/2017       NaN         NaN   78.0      NaN
85             NaN  5/3/2017       NaN         NaN   82.0      NaN

## <h1 style="color:blue">Pivot Table</h1>

In [124]:
df = pd.read_csv("weather2.csv")
df

       date      city  temperature  humidity
0  5/1/2017  new york           65        56
1  5/1/2017  new york           61        54
2  5/2/2017  new york           70        60
3  5/2/2017  new york           72        62
4  5/1/2017    mumbai           75        80
5  5/1/2017    mumbai           78        83
6  5/2/2017    mumbai           82        85
7  5/2/2017    mumbai           80        26

In [125]:
df.pivot_table(index="city",columns="date")

         humidity          temperature
date     5/1/2017 5/2/2017    5/1/2017 5/2/2017
city
mumbai       81.5     55.5        76.5     81.0
new york     55.0     61.0        63.0     71.0

<h2 style="color:brown">Margins</h2>

In [126]:
df.pivot_table(index="city",columns="date", margins=True,aggfunc=np.sum)

         humidity               temperature
date     5/1/2017 5/2/2017  All    5/1/2017 5/2/2017  All
city
mumbai        163      111  274         153      162  315
new york      110      122  232         126      142  268
All           273      233  506         279      304  583

In [127]:
df.pivot_table(index="city",columns="date",aggfunc=np.sum)

         humidity          temperature
date     5/1/2017 5/2/2017    5/1/2017 5/2/2017
city
mumbai        163      111         153      162
new york      110      122         126      142

In [128]:
df.pivot_table(index="city",columns="date",aggfunc=np.sum)["humidity"]

date      5/1/2017  5/2/2017
city
mumbai         163       111
new york       110       122

<h2 style="color:brown">Grouper</h2>

In [129]:
df = pd.read_csv("weather3.csv")
df

        date      city  temperature  humidity
0   5/1/2017  new york           65        56
1   5/2/2017  new york           61        54
2   5/3/2017  new york           70        60
3  12/1/2017  new york           30        50
4  12/2/2017  new york           28        52
5  12/3/2017  new york           25        51

In [130]:
print(type(df["date"][0]))
df['date'] = pd.to_datetime(df['date'])

<class 'str'>

In [131]:
df

        date      city  temperature  humidity
0 2017-05-01  new york           65        56
1 2017-05-02  new york           61        54
2 2017-05-03  new york           70        60
3 2017-12-01  new york           30        50
4 2017-12-02  new york           28        52
5 2017-12-03  new york           25        51

In [132]:
type(df["date"][0])

pandas._libs.tslibs.timestamps.Timestamp

In [133]:
df.pivot_table(index=pd.Grouper(freq='W',key='date'),columns='city')

             humidity temperature
city         new york    new york
date
2017-05-07  56.666667   65.333333
2017-12-03  51.000000   27.666667

## Reshape pandas dataframe using melt

In [134]:
import pandas as pd
df = pd.read_csv("weather.csv")
df

       date      city  temperature  humidity
0  5/1/2017  new york           65        56
1  5/2/2017  new york           66        58
2  5/3/2017  new york           68        60
3  5/1/2017    mumbai           75        80
4  5/2/2017    mumbai           78        83
5  5/3/2017    mumbai           82        85
6  5/1/2017   beijing           80        26
7  5/2/2017   beijing           77        30
8  5/3/2017   beijing           79        35

In [142]:
df[["day", "chicago"]]

KeyError: "None of [Index(['day', 'chicago'], dtype='object')] are in the [columns]"

In [143]:
df[["day", "berlin"]]

KeyError: "None of [Index(['day', 'berlin'], dtype='object')] are in the [columns]"

In [144]:
melted = pd.melt(df, id_vars=["day"], var_name='city', value_name='temp')
melted

KeyError: "The following 'id_vars' are not present in the DataFrame: ['day']"

In [145]:
city = melted [ melted["city"] == "berlin" ]

NameError: name 'melted' is not defined

In [146]:
city

NameError: name 'city' is not defined

In [147]:
city = city.drop("city", axis=1)
city

NameError: name 'city' is not defined

In [148]:
city.rename({"temp" : "berlin" },axis=1 , inplace=True)

NameError: name 'city' is not defined

<h1 style="color:blue" align="center">Crosstab Tutorial</h1>

In [153]:
import pandas as pd
df = pd.read_excel("survey.xls")
df

ImportError: Missing optional dependency 'xlrd'. Install xlrd >= 2.0.1 for xls Excel support Use pip or conda to install xlrd.

In [154]:
pd.crosstab(df.Nationality,df.Handedness)

AttributeError: 'DataFrame' object has no attribute 'Nationality'

In [155]:
pd.crosstab(df.Sex,df.Handedness)

AttributeError: 'DataFrame' object has no attribute 'Sex'

<h2 style="color:purple">Margins</h2>

In [156]:
pd.crosstab(df.Sex,df.Handedness, margins=True)

AttributeError: 'DataFrame' object has no attribute 'Sex'

<h2 style="color:purple">Multi Index Column and Rows</h2>

In [157]:
pd.crosstab(df.Sex, [df.Handedness,df.Nationality], margins=True)

AttributeError: 'DataFrame' object has no attribute 'Sex'

In [158]:
pd.crosstab([df.Nationality, df.Sex], [df.Handedness], margins=True)

AttributeError: 'DataFrame' object has no attribute 'Nationality'

<h2 style="color:purple">Normalize</h2>

In [159]:
pd.crosstab(df.Sex, df.Handedness, normalize='index')

AttributeError: 'DataFrame' object has no attribute 'Sex'

<h2 style="color:purple">Aggfunc and Values</h2>

In [160]:
import numpy as np
pd.crosstab(df.Sex, df.Handedness, values=df.Age, aggfunc=np.average)

AttributeError: 'DataFrame' object has no attribute 'Sex'